app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations" WHERE "locations"."customer" = 'a' LIMIT 1
SELECT "locations".* FROM "locations"
---
  def index
    if params[:search].present?

      @locations = Array(Location.find_by_customer(params[:search]))
    else
      @locations = Location.all

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @location = Location.find(params[:id])

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @location = Location.find(params[:id])

INSERT INTO "locations" ("address", "city", "country", "created_at", "district", "lat", "lng", "location_name", "phone_number", "postcode", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
     @location = Location.new(params[:location])
      respond_to do |format|
        if @location.save

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "locations" SET "lat" = '17.3850°', "lng" = '78.4867°', "updated_at" = '2019-05-01 07:31:42.798256' WHERE "locations"."id" = 2
---
  def update
    @location = Location.find(params[:id])

    respond_to do |format|
      if @location.update_attributes(params[:location])

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "locations" WHERE "locations"."id" = ?  [["id", 980190962]]
---
  def destroy
    @location = Location.find(params[:id])
    @location.destroy